Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D27CD5M.atdf
        <register caption="Interrupt Status Register" name="AES_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access (cleared by writing SWRST in AES_CR)" mask="0x0000F000" name="URAT" values="AES_ISR__URAT"/>
          <bitfield caption="GCM Tag Ready" mask="0x00010000" name="TAGRDY"/>
          <bitfield caption="End of Padding" mask="0x00020000" name="EOPAD"/>
          <bitfield caption="Padding Length Error" mask="0x00040000" name="PLENERR"/>
        </register>
        <register caption="Key Word Register" count="8" name="AES_KEYWR" offset="0x20" rw="W" size="4">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Input Data Register" count="4" name="AES_IDATAR" offset="0x40" rw="W" size="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register" count="4" name="AES_ODATAR" offset="0x50" rw="R" size="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register" count="4" name="AES_IVR" offset="0x60" rw="W" size="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Additional Authenticated Data Length Register" name="AES_AADLENR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Additional Authenticated Data Length" mask="0xFFFFFFFF" name="AADLEN"/>
        </register>
        <register caption="Plaintext/Ciphertext Length Register" name="AES_CLENR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Plaintext/Ciphertext Length" mask="0xFFFFFFFF" name="CLEN"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register" count="4" name="AES_GHASHR" offset="0x78" rw="RW" size="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Authentication Tag Word Register" count="4" name="AES_TAGR" offset="0x88" rw="R" size="4">
          <bitfield caption="GCM Authentication Tag x" mask="0xFFFFFFFF" name="TAG"/>
        </register>
        <register caption="GCM Encryption Counter Value Register" name="AES_CTRR" offset="0x98" rw="R" size="4">
          <bitfield caption="GCM Encryption Counter" mask="0xFFFFFFFF" name="CTR"/>
        </register>
        <register caption="GCM H Word Register" count="4" name="AES_GCMHR" offset="0x9C" rw="RW" size="4">
          <bitfield caption="GCM H Word x" mask="0xFFFFFFFF" name="H"/>
        </register>
        <register caption="Extended Mode Register" name="AES_EMR" offset="0xB0" rw="RW" size="4">
          <bitfield caption="Auto Padding Enable" mask="0x00000001" name="APEN"/>
          <bitfield caption="Auto Padding Mode" mask="0x00000002" name="APM"/>
          <bitfield caption="Protocol Layer Improved Performance Enable" mask="0x00000010" name="PLIPEN"/>
          <bitfield caption="Protocol Layer Improved Performance Decipher" mask="0x00000020" name="PLIPD"/>
          <bitfield caption="Auto Padding Length" mask="0x0000FF00" name="PADLEN"/>
          <bitfield caption="IPSEC Next Header" mask="0x00FF0000" name="NHEAD"/>
        </register>
        <register caption="Byte Counter Register" name="AES_BCNT" offset="0xB4" rw="RW" size="4">
          <bitfield caption="Auto Padding Byte Counter" mask="0xFFFFFFFF" name="BCNT"/>
        </register>
        <register caption="Tweak Word Register" count="4" name="AES_TWR" offset="0xC0" rw="RW" size="4">
          <bitfield caption="Tweak Word x" mask="0xFFFFFFFF" name="TWEAK"/>
        </register>
        <register caption="Alpha Word Register" count="4" name="AES_ALPHAR" offset="0xD0" rw="W" size="4">
          <bitfield caption="Alpha Word x" mask="0xFFFFFFFF" name="ALPHA"/>
        </register>
      </register-group>
      <value-group caption="Dual Input Buffer" name="AES_MR__DUALBUFF">
        <value caption="AES_IDATARx cannot be written during processing of previous block." name="INACTIVE" value="0"/>
        <value caption="AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files." name="ACTIVE" value="1"/>
      </value-group>
      <value-group caption="Start Mode" name="AES_MR__SMOD">
        <value caption="Manual Mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto Mode" name="AUTO_START" value="0x1"/>
        <value caption="AES_IDATAR0 access only Auto Mode (DMA)" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="Key Size" name="AES_MR__KEYSIZE">
        <value caption="AES Key Size is 128 bits" name="AES128" value="0x0"/>
        <value caption="AES Key Size is 192 bits" name="AES192" value="0x1"/>
        <value caption="AES Key Size is 256 bits" name="AES256" value="0x2"/>
      </value-group>
      <value-group caption="Operating Mode" name="AES_MR__OPMOD">
        <value caption="ECB: Electronic Codebook mode" name="ECB" value="0x0"/>
        <value caption="CBC: Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="OFB: Output Feedback mode" name="OFB" value="0x2"/>
        <value caption="CFB: Cipher Feedback mode" name="CFB" value="0x3"/>
        <value caption="CTR: Counter mode (16-bit internal counter)" name="CTR" value="0x4"/>
        <value caption="GCM: Galois/Counter mode" name="GCM" value="0x5"/>
        <value caption="XTS: XEX-based tweaked-codebook mode" name="XTS" value="0x6"/>
      </value-group>
      <value-group caption="Cipher Feedback Data Size" name="AES_MR__CFBS">
        <value caption="128-bit" name="SIZE_128BIT" value="0x0"/>
        <value caption="64-bit" name="SIZE_64BIT" value="0x1"/>
        <value caption="32-bit" name="SIZE_32BIT" value="0x2"/>
        <value caption="16-bit" name="SIZE_16BIT" value="0x3"/>
        <value caption="8-bit" name="SIZE_8BIT" value="0x4"/>
      </value-group>
      <value-group caption="Key" name="AES_MR__CKEY">
        <value caption="This field must be written with 0xE the first time AES_MR is programmed. For subsequent programming of AES_MR, any value can be written, including that of 0xE.Always reads as 0." name="PASSWD" value="0xE"/>
      </value-group>
      <value-group caption="Unspecified Register Access (cleared by writing SWRST in AES_CR)" name="AES_ISR__URAT">
        <value caption="Input Data register written during the data processing when SMOD = 2 mode." name="IDR_WR_PROCESSING" value="0x0"/>
        <value caption="Output Data register read during the data processing." name="ODR_RD_PROCESSING" value="0x1"/>
        <value caption="Mode register written during the data processing." name="MR_WR_PROCESSING" value="0x2"/>
        <value caption="Output Data register read during the sub-keys generation." name="ODR_RD_SUBKGEN" value="0x3"/>
        <value caption="Mode register written during the sub-keys generation." name="MR_WR_SUBKGEN" value="0x4"/>
        <value caption="Write-only register read access." name="WOR_RD_ACCESS" value="0x5"/>
      </value-group>
    </module>
    <module caption="Advanced Encryption Standard Bridge" id="11145" name="AESB" version="E">
      <register-group name="AESB">
        <register caption="Control Register" name="AESB_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="AESB_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="Automatic Bridge Mode" mask="0x00000004" name="AAHB"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000008" name="DUALBUFF" values="AESB_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AESB_MR__SMOD"/>
          <bitfield caption="Operating Mode" mask="0x00007000" name="OPMOD" values="AESB_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Key" mask="0x00F00000" name="CKEY" values="AESB_MR__CKEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="AESB_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
        </register>
        <register caption="Interrupt Disable Register" name="AESB_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
        </register>
