Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D27CD5M.atdf
        <register caption="SPI FIFO Level Register" name="FLEX_SPI_FLR" offset="0x444" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="SPI Comparison Register" name="FLEX_SPI_CMPR" offset="0x448" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x0000FFFF" name="VAL1"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0xFFFF0000" name="VAL2"/>
        </register>
        <register caption="SPI Write Protection Mode Register" name="FLEX_SPI_WPMR" offset="0x4E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_SPI_WPMR__WPKEY"/>
        </register>
        <register caption="SPI Write Protection Status Register" name="FLEX_SPI_WPSR" offset="0x4E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
        <register caption="TWI Control Register" name="FLEX_TWI_CR" offset="0x600" rw="W" size="4">
          <mode name="DEFAULT" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="1"/>
          <bitfield caption="Send a START Condition" mask="0x00000001" modes="DEFAULT" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" modes="DEFAULT" name="STOP"/>
          <bitfield caption="TWI Master Mode Enabled" mask="0x00000004" modes="DEFAULT" name="MSEN"/>
          <bitfield caption="TWI Master Mode Disabled" mask="0x00000008" modes="DEFAULT" name="MSDIS"/>
          <bitfield caption="TWI Slave Mode Enabled" mask="0x00000010" modes="DEFAULT" name="SVEN"/>
          <bitfield caption="TWI Slave Mode Disabled" mask="0x00000020" modes="DEFAULT" name="SVDIS"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" modes="DEFAULT" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" modes="DEFAULT" name="SWRST"/>
          <bitfield caption="TWI High-Speed Mode Enabled" mask="0x00000100" modes="DEFAULT" name="HSEN"/>
          <bitfield caption="TWI High-Speed Mode Disabled" mask="0x00000200" modes="DEFAULT" name="HSDIS"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" modes="DEFAULT" name="SMBEN"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" modes="DEFAULT" name="SMBDIS"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" modes="DEFAULT" name="PECEN"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" modes="DEFAULT" name="PECDIS"/>
          <bitfield caption="PEC Request" mask="0x00004000" modes="DEFAULT" name="PECRQ"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" modes="DEFAULT" name="CLEAR"/>
          <bitfield caption="Alternative Command Mode Enable" mask="0x00010000" modes="DEFAULT" name="ACMEN"/>
          <bitfield caption="Alternative Command Mode Disable" mask="0x00020000" modes="DEFAULT" name="ACMDIS"/>
          <bitfield caption="Transmit Holding Register Clear" mask="0x01000000" modes="DEFAULT" name="THRCLR"/>
          <bitfield caption="Lock Clear" mask="0x04000000" modes="DEFAULT" name="LOCKCLR"/>
          <bitfield caption="FIFO Enable" mask="0x10000000" modes="DEFAULT" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x20000000" modes="DEFAULT" name="FIFODIS"/>
          <bitfield caption="Send a START Condition" mask="0x00000001" modes="FIFO_ENABLED" name="START"/>
          <bitfield caption="Send a STOP Condition" mask="0x00000002" modes="FIFO_ENABLED" name="STOP"/>
          <bitfield caption="TWI Master Mode Enabled" mask="0x00000004" modes="FIFO_ENABLED" name="MSEN"/>
          <bitfield caption="TWI Master Mode Disabled" mask="0x00000008" modes="FIFO_ENABLED" name="MSDIS"/>
          <bitfield caption="TWI Slave Mode Enabled" mask="0x00000010" modes="FIFO_ENABLED" name="SVEN"/>
          <bitfield caption="TWI Slave Mode Disabled" mask="0x00000020" modes="FIFO_ENABLED" name="SVDIS"/>
          <bitfield caption="SMBus Quick Command" mask="0x00000040" modes="FIFO_ENABLED" name="QUICK"/>
          <bitfield caption="Software Reset" mask="0x00000080" modes="FIFO_ENABLED" name="SWRST"/>
          <bitfield caption="TWI High-Speed Mode Enabled" mask="0x00000100" modes="FIFO_ENABLED" name="HSEN"/>
          <bitfield caption="TWI High-Speed Mode Disabled" mask="0x00000200" modes="FIFO_ENABLED" name="HSDIS"/>
          <bitfield caption="SMBus Mode Enabled" mask="0x00000400" modes="FIFO_ENABLED" name="SMBEN"/>
          <bitfield caption="SMBus Mode Disabled" mask="0x00000800" modes="FIFO_ENABLED" name="SMBDIS"/>
          <bitfield caption="Packet Error Checking Enable" mask="0x00001000" modes="FIFO_ENABLED" name="PECEN"/>
          <bitfield caption="Packet Error Checking Disable" mask="0x00002000" modes="FIFO_ENABLED" name="PECDIS"/>
          <bitfield caption="PEC Request" mask="0x00004000" modes="FIFO_ENABLED" name="PECRQ"/>
          <bitfield caption="Bus CLEAR Command" mask="0x00008000" modes="FIFO_ENABLED" name="CLEAR"/>
          <bitfield caption="Alternative Command Mode Enable" mask="0x00010000" modes="FIFO_ENABLED" name="ACMEN"/>
          <bitfield caption="Alternative Command Mode Disable" mask="0x00020000" modes="FIFO_ENABLED" name="ACMDIS"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" modes="FIFO_ENABLED" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" modes="FIFO_ENABLED" name="RXFCLR"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" modes="FIFO_ENABLED" name="TXFLCLR"/>
          <bitfield caption="FIFO Enable" mask="0x10000000" modes="FIFO_ENABLED" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x20000000" modes="FIFO_ENABLED" name="FIFODIS"/>
        </register>
