Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D27CD5M.atdf
        <register caption="LCD Controller Configuration Register 2" name="LCDC_LCDCFG2" offset="0x00000008" rw="RW" size="4">
          <bitfield caption="Vertical Front Porch Width" mask="0x000003FF" name="VFPW"/>
          <bitfield caption="Vertical Back Porch Width" mask="0x03FF0000" name="VBPW"/>
        </register>
        <register caption="LCD Controller Configuration Register 3" name="LCDC_LCDCFG3" offset="0x0000000C" rw="RW" size="4">
          <bitfield caption="Horizontal Front Porch Width" mask="0x000003FF" name="HFPW"/>
          <bitfield caption="Horizontal Back Porch Width" mask="0x03FF0000" name="HBPW"/>
        </register>
        <register caption="LCD Controller Configuration Register 4" name="LCDC_LCDCFG4" offset="0x00000010" rw="RW" size="4">
          <bitfield caption="Number of Pixels Per Line" mask="0x000007FF" name="PPL"/>
          <bitfield caption="Number of Active Row Per Frame" mask="0x07FF0000" name="RPF"/>
        </register>
        <register caption="LCD Controller Configuration Register 5" name="LCDC_LCDCFG5" offset="0x00000014" rw="RW" size="4">
          <bitfield caption="Horizontal Synchronization Pulse Polarity" mask="0x00000001" name="HSPOL"/>
          <bitfield caption="Vertical Synchronization Pulse Polarity" mask="0x00000002" name="VSPOL"/>
          <bitfield caption="Vertical Synchronization Pulse Start" mask="0x00000004" name="VSPDLYS"/>
          <bitfield caption="Vertical Synchronization Pulse End" mask="0x00000008" name="VSPDLYE"/>
          <bitfield caption="Display Signal Polarity" mask="0x00000010" name="DISPPOL"/>
          <bitfield caption="LCD Controller Dithering" mask="0x00000040" name="DITHER"/>
          <bitfield caption="LCD Controller Display Power Signal Synchronization" mask="0x00000080" name="DISPDLY"/>
          <bitfield caption="LCD Controller Output Mode" mask="0x00000300" name="MODE" values="LCDC_LCDCFG5__MODE"/>
          <bitfield caption="Post Processing Enable" mask="0x00000400" name="PP"/>
          <bitfield caption="LCD Controller Vertical synchronization Pulse Setup Configuration" mask="0x00001000" name="VSPSU"/>
          <bitfield caption="LCD Controller Vertical synchronization Pulse Hold Configuration" mask="0x00002000" name="VSPHO"/>
          <bitfield caption="LCD DISPLAY Guard Time" mask="0x00FF0000" name="GUARDTIME"/>
        </register>
        <register caption="LCD Controller Configuration Register 6" name="LCDC_LCDCFG6" offset="0x00000018" rw="RW" size="4">
          <bitfield caption="PWM Clock Prescaler" mask="0x00000007" name="PWMPS" values="LCDC_LCDCFG6__PWMPS"/>
          <bitfield caption="LCD Controller PWM Signal Polarity" mask="0x00000010" name="PWMPOL"/>
          <bitfield caption="LCD Controller PWM Compare Value" mask="0x0000FF00" name="PWMCVAL"/>
        </register>
        <register caption="LCD Controller Enable Register" name="LCDC_LCDEN" offset="0x00000020" rw="W" size="4">
          <bitfield caption="LCD Controller Pixel Clock Enable" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="LCD Controller Horizontal and Vertical Synchronization Enable" mask="0x00000002" name="SYNCEN"/>
          <bitfield caption="LCD Controller DISP Signal Enable" mask="0x00000004" name="DISPEN"/>
          <bitfield caption="LCD Controller Pulse Width Modulation Enable" mask="0x00000008" name="PWMEN"/>
        </register>
        <register caption="LCD Controller Disable Register" name="LCDC_LCDDIS" offset="0x00000024" rw="W" size="4">
          <bitfield caption="LCD Controller Pixel Clock Disable" mask="0x00000001" name="CLKDIS"/>
          <bitfield caption="LCD Controller Horizontal and Vertical Synchronization Disable" mask="0x00000002" name="SYNCDIS"/>
          <bitfield caption="LCD Controller DISP Signal Disable" mask="0x00000004" name="DISPDIS"/>
          <bitfield caption="LCD Controller Pulse Width Modulation Disable" mask="0x00000008" name="PWMDIS"/>
          <bitfield caption="LCD Controller Clock Reset" mask="0x00000100" name="CLKRST"/>
          <bitfield caption="LCD Controller Horizontal and Vertical Synchronization Reset" mask="0x00000200" name="SYNCRST"/>
          <bitfield caption="LCD Controller DISP Signal Reset" mask="0x00000400" name="DISPRST"/>
          <bitfield caption="LCD Controller PWM Reset" mask="0x00000800" name="PWMRST"/>
        </register>
        <register caption="LCD Controller Status Register" name="LCDC_LCDSR" offset="0x00000028" rw="R" size="4">
          <bitfield caption="Clock Status" mask="0x00000001" name="CLKSTS"/>
          <bitfield caption="LCD Controller Synchronization status" mask="0x00000002" name="LCDSTS"/>
          <bitfield caption="LCD Controller DISP Signal Status" mask="0x00000004" name="DISPSTS"/>
          <bitfield caption="LCD Controller PWM Signal Status" mask="0x00000008" name="PWMSTS"/>
          <bitfield caption="Synchronization In Progress" mask="0x00000010" name="SIPSTS"/>
        </register>
        <register caption="LCD Controller Interrupt Enable Register" name="LCDC_LCDIER" offset="0x0000002C" rw="W" size="4">
          <bitfield caption="Start of Frame Interrupt Enable" mask="0x00000001" name="SOFIE"/>
          <bitfield caption="LCD Disable Interrupt Enable" mask="0x00000002" name="DISIE"/>
          <bitfield caption="Powerup/Powerdown Sequence Terminated Interrupt Enable" mask="0x00000004" name="DISPIE"/>
          <bitfield caption="Output FIFO Error Interrupt Enable" mask="0x00000010" name="FIFOERRIE"/>
          <bitfield caption="Base Layer Interrupt Enable" mask="0x00000100" name="BASEIE"/>
          <bitfield caption="Overlay 1 Interrupt Enable" mask="0x00000200" name="OVR1IE"/>
          <bitfield caption="Overlay 2 Interrupt Enable" mask="0x00000400" name="OVR2IE"/>
          <bitfield caption="High-End Overlay Interrupt Enable" mask="0x00000800" name="HEOIE"/>
          <bitfield caption="Post Processing Interrupt Enable" mask="0x00002000" name="PPIE"/>
        </register>
        <register caption="LCD Controller Interrupt Disable Register" name="LCDC_LCDIDR" offset="0x00000030" rw="W" size="4">
          <bitfield caption="Start of Frame Interrupt Disable" mask="0x00000001" name="SOFID"/>
          <bitfield caption="LCD Disable Interrupt Disable" mask="0x00000002" name="DISID"/>
          <bitfield caption="Powerup/Powerdown Sequence Terminated Interrupt Disable" mask="0x00000004" name="DISPID"/>
          <bitfield caption="Output FIFO Error Interrupt Disable" mask="0x00000010" name="FIFOERRID"/>
          <bitfield caption="Base Layer Interrupt Disable" mask="0x00000100" name="BASEID"/>
          <bitfield caption="Overlay 1 Interrupt Disable" mask="0x00000200" name="OVR1ID"/>
          <bitfield caption="Overlay 2 Interrupt Disable" mask="0x00000400" name="OVR2ID"/>
          <bitfield caption="High-End Overlay Interrupt Disable" mask="0x00000800" name="HEOID"/>
          <bitfield caption="Post Processing Interrupt Disable" mask="0x00002000" name="PPID"/>
        </register>
        <register caption="LCD Controller Interrupt Mask Register" name="LCDC_LCDIMR" offset="0x00000034" rw="R" size="4">
          <bitfield caption="Start of Frame Interrupt Mask" mask="0x00000001" name="SOFIM"/>
          <bitfield caption="LCD Disable Interrupt Mask" mask="0x00000002" name="DISIM"/>
          <bitfield caption="Powerup/Powerdown Sequence Terminated Interrupt Mask" mask="0x00000004" name="DISPIM"/>
          <bitfield caption="Output FIFO Error Interrupt Mask" mask="0x00000010" name="FIFOERRIM"/>
          <bitfield caption="Base Layer Interrupt Mask" mask="0x00000100" name="BASEIM"/>
          <bitfield caption="Overlay 1 Interrupt Mask" mask="0x00000200" name="OVR1IM"/>
          <bitfield caption="Overlay 2 Interrupt Mask" mask="0x00000400" name="OVR2IM"/>
          <bitfield caption="High-End Overlay Interrupt Mask" mask="0x00000800" name="HEOIM"/>
          <bitfield caption="Post Processing Interrupt Mask" mask="0x00002000" name="PPIM"/>
        </register>
