Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D27CD5M.atdf
        <register caption="Retuning Timer Interrupt Status Enable Register" name="SDMMC_RTISTER" offset="0x218" rw="RW" size="1">
          <bitfield caption="Retuning Timer Event" mask="0x00000001" name="TEVT" values="SDMMC_RTISTER__TEVT"/>
        </register>
        <register caption="Retuning Timer Interrupt Signal Enable Register" name="SDMMC_RTISIER" offset="0x219" rw="RW" size="1">
          <bitfield caption="Retuning Timer Event" mask="0x00000001" name="TEVT" values="SDMMC_RTISIER__TEVT"/>
        </register>
        <register caption="Retuning Timer Interrupt Status Register" name="SDMMC_RTISTR" offset="0x21C" rw="RW" size="1">
          <bitfield caption="Retuning Timer Event" mask="0x00000001" name="TEVT"/>
        </register>
        <register caption="Retuning Timer Status Slots Register" name="SDMMC_RTSSR" offset="0x21D" rw="R" size="1">
          <bitfield caption="Retuning Timer Event Slots" mask="0x00000003" name="TEVTSLOT"/>
        </register>
        <register caption="Tuning Control Register" name="SDMMC_TUNCR" offset="0x220" rw="RW" size="4">
          <bitfield caption="Sampling Point" mask="0x00000001" name="SMPLPT"/>
        </register>
        <register caption="Capabilities Control Register" name="SDMMC_CACR" offset="0x230" rw="RW" size="4">
          <bitfield caption="Capabilities Write Enable" mask="0x00000001" name="CAPWREN"/>
          <bitfield caption="Key" mask="0x0000FF00" name="KEY"/>
        </register>
        <register caption="Calibration Control Register" name="SDMMC_CALCR" offset="0x240" rw="RW" size="4">
          <bitfield caption="PADs Calibration Enable" mask="0x00000001" name="EN"/>
          <bitfield caption="Calibration Analog Always ON" mask="0x00000010" name="ALWYSON"/>
          <bitfield caption="Calibration During Tuning Disabled" mask="0x00000020" name="TUNDIS"/>
          <bitfield caption="Calibration Counter Value" mask="0x0000FF00" name="CNTVAL"/>
          <bitfield caption="Calibration N Status" mask="0x000F0000" name="CALN"/>
          <bitfield caption="Calibration P Status" mask="0x0F000000" name="CALP"/>
        </register>
      </register-group>
      <value-group caption="SDMA Buffer Boundary" name="SDMMC_BSR__BOUNDARY">
        <value caption="4-Kbyte boundary" name="_4K" value="0x0"/>
        <value caption="8-Kbyte boundary" name="_8K" value="0x1"/>
        <value caption="16-Kbyte boundary" name="_16K" value="0x2"/>
        <value caption="32-Kbyte boundary" name="_32K" value="0x3"/>
        <value caption="64-Kbyte boundary" name="_64K" value="0x4"/>
        <value caption="128-Kbyte boundary" name="_128K" value="0x5"/>
        <value caption="256-Kbyte boundary" name="_256k" value="0x6"/>
        <value caption="512-Kbyte boundary" name="_512K" value="0x7"/>
      </value-group>
      <value-group caption="DMA Enable" name="SDMMC_TMR__DMAEN">
        <value caption="DMA functionality is disabled." name="DISABLED" value="0"/>
        <value caption="DMA functionality is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Block Count Enable" name="SDMMC_TMR__BCEN">
        <value caption="Block count is disabled." name="DISABLED" value="0"/>
        <value caption="Block count is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Auto Command Enable" name="SDMMC_TMR__ACMDEN">
        <value caption="Auto Command Disabled" name="DISABLED" value="0x0"/>
        <value caption="Auto CMD12 Enabled" name="CMD12" value="0x1"/>
        <value caption="Auto CMD23 Enabled" name="CMD23" value="0x2"/>
      </value-group>
      <value-group caption="Data Transfer Direction Selection" name="SDMMC_TMR__DTDSEL">
        <value caption="Writes data from the SDMMC to the device." name="WRITE" value="0"/>
        <value caption="Reads data from the device to the SDMMC." name="READ" value="1"/>
      </value-group>
      <value-group caption="Response Type" name="SDMMC_CR__RESPTYP">
        <value caption="No Response" name="NORESP" value="0x0"/>
        <value caption="Response Length 136" name="RL136" value="0x1"/>
        <value caption="Response Length 48" name="RL48" value="0x2"/>
        <value caption="Response Length 48 with Busy" name="RL48BUSY" value="0x3"/>
      </value-group>
      <value-group caption="Command CRC Check Enable" name="SDMMC_CR__CMDCCEN">
        <value caption="The Command CRC Check is disabled." name="DISABLED" value="0"/>
        <value caption="The Command CRC Check is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Index Check Enable" name="SDMMC_CR__CMDICEN">
        <value caption="The Command Index Check is disabled." name="DISABLED" value="0"/>
        <value caption="The Command Index Check is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Type" name="SDMMC_CR__CMDTYP">
        <value caption="Other commands" name="NORMAL" value="0x0"/>
        <value caption="CMD52 to write &quot;Bus Suspend&quot; in the Card Common Control Registers (CCCR) (for SDIO only)" name="SUSPEND" value="0x1"/>
        <value caption="CMD52 to write &quot;Function Select&quot; in the Card Common Control Registers (CCCR) (for SDIO only)" name="RESUME" value="0x2"/>
        <value caption="CMD12, CMD52 to write &quot;I/O Abort&quot; in the Card Common Control Registers (CCCR) (for SDIO only)" name="ABORT" value="0x3"/>
      </value-group>
      <value-group caption="LED Control" name="SDMMC_HC1R__LEDCTRL">
        <value caption="LED off." name="OFF" value="0"/>
        <value caption="LED on." name="ON" value="1"/>
      </value-group>
      <value-group caption="Data Width" name="SDMMC_HC1R__DW">
        <value caption="1-bit mode." name="_1_BIT" value="0"/>
        <value caption="4-bit mode." name="_4_BIT" value="1"/>
      </value-group>
      <value-group caption="DMA Select" name="SDMMC_HC1R__DMASEL">
        <value caption="SDMA is selected" name="SDMA" value="0x0"/>
        <value caption="32-bit Address ADMA2 is selected" name="ADMA32" value="0x2"/>
      </value-group>
      <value-group caption="Data Width" name="SDMMC_HC1R_E_MMC__DW">
        <value caption="1-bit mode." name="_1_BIT" value="0"/>
        <value caption="4-bit mode." name="_4_BIT" value="1"/>
      </value-group>
      <value-group caption="DMA Select" name="SDMMC_HC1R_E_MMC__DMASEL">
        <value caption="SDMA is selected" name="SDMA" value="0x0"/>
        <value caption="32-bit Address ADMA2 is selected" name="ADMA32" value="0x2"/>
      </value-group>
      <value-group caption="Interrupt at Block Gap" name="SDMMC_BGCR__INTBG">
        <value caption="Interrupt detection disabled." name="DISABLED" value="0"/>
        <value caption="Interrupt detection enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Wakeup Event Enable on Card Interrupt" name="SDMMC_WCR__WKENCINT">
        <value caption="Wakeup Event disabled." name="DISABLED" value="0"/>
        <value caption="Wakeup Event enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Wakeup Event Enable on Card Insertion" name="SDMMC_WCR__WKENCINS">
        <value caption="Wakeup Event disabled." name="DISABLED" value="0"/>
        <value caption="Wakeup Event enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Wakeup Event Enable on Card Removal" name="SDMMC_WCR__WKENCREM">
        <value caption="Wakeup Event disabled." name="DISABLED" value="0"/>
        <value caption="Wakeup Event enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Command Complete Status Enable" name="SDMMC_NISTER__CMDC">
        <value caption="The CMDC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The CMDC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Transfer Complete Status Enable" name="SDMMC_NISTER__TRFC">
        <value caption="The TRFC status flag in SDMMC_NISTR is masked." name="MASKED" value="0"/>
        <value caption="The TRFC status flag in SDMMC_NISTR is enabled." name="ENABLED" value="1"/>
      </value-group>
