Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D27CD5M.atdf
      <value-group caption="Wake-up 6 Input Status" name="SHDW_SR__WKUPIS6">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 7 Input Status" name="SHDW_SR__WKUPIS7">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 8 Input Status" name="SHDW_SR__WKUPIS8">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 9 Input Status" name="SHDW_SR__WKUPIS9">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 0 Input Enable" name="SHDW_WUIR__WKUPEN0">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 1 Input Enable" name="SHDW_WUIR__WKUPEN1">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 2 Input Enable" name="SHDW_WUIR__WKUPEN2">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 3 Input Enable" name="SHDW_WUIR__WKUPEN3">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 4 Input Enable" name="SHDW_WUIR__WKUPEN4">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 5 Input Enable" name="SHDW_WUIR__WKUPEN5">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 6 Input Enable" name="SHDW_WUIR__WKUPEN6">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 7 Input Enable" name="SHDW_WUIR__WKUPEN7">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 8 Input Enable" name="SHDW_WUIR__WKUPEN8">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 9 Input Enable" name="SHDW_WUIR__WKUPEN9">
        <value caption="The corresponding wake-up input has no wake-up effect." name="DISABLE" value="0"/>
        <value caption="The corresponding wake-up input forces the wake-up of the core power supply." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="Wake-up 0 Input Type" name="SHDW_WUIR__WKUPT0">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 1 Input Type" name="SHDW_WUIR__WKUPT1">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 2 Input Type" name="SHDW_WUIR__WKUPT2">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 3 Input Type" name="SHDW_WUIR__WKUPT3">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 4 Input Type" name="SHDW_WUIR__WKUPT4">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 5 Input Type" name="SHDW_WUIR__WKUPT5">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 6 Input Type" name="SHDW_WUIR__WKUPT6">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 7 Input Type" name="SHDW_WUIR__WKUPT7">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 8 Input Type" name="SHDW_WUIR__WKUPT8">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="Wake-up 9 Input Type" name="SHDW_WUIR__WKUPT9">
        <value caption="A falling edge followed by a low level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="LOW" value="0"/>
        <value caption="A rising edge followed by a high level, for a period defined by WKUPDBC, on the corresponding wake-up input forces the wake-up of the core power supply." name="HIGH" value="1"/>
      </value-group>
    </module>
    <module caption="Static Memory Controller" id="11036" name="SMC" version="T">
      <register-group name="SMC_CS_NUMBER" size="20">
        <register caption="Setup Register" name="HSMC_SETUP" offset="0x0" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="Pulse Register" name="HSMC_PULSE" offset="0x4" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000007F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00007F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x007F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x7F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="Cycle Register" name="HSMC_CYCLE" offset="0x8" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="Timings Register" name="HSMC_TIMINGS" offset="0xC" rw="RW" size="4">
          <bitfield caption="CLE to REN Low Delay" mask="0x0000000F" name="TCLR"/>
          <bitfield caption="ALE to Data Start" mask="0x000000F0" name="TADL"/>
          <bitfield caption="ALE to REN Low Delay" mask="0x00000F00" name="TAR"/>
          <bitfield caption="Off Chip Memory Scrambling Enable" mask="0x00001000" name="OCMS"/>
          <bitfield caption="Ready to REN Low Delay" mask="0x000F0000" name="TRR"/>
          <bitfield caption="WEN High to REN to Busy" mask="0x0F000000" name="TWB"/>
          <bitfield caption="NAND Flash Selection" mask="0x80000000" name="NFSEL"/>
        </register>
        <register caption="Mode Register" name="HSMC_MODE" offset="0x10" rw="RW" size="4">
          <bitfield caption="Selection of the Control Signal for Read Operation" mask="0x00000001" name="READ_MODE" values="HSMC_MODE0__READ_MODE"/>
          <bitfield caption="Selection of the Control Signal for Write Operation" mask="0x00000002" name="WRITE_MODE" values="HSMC_MODE0__WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="HSMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT" values="HSMC_MODE0__BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="HSMC_MODE0__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
        </register>
      </register-group>
      <register-group name="SMC_PMECC" size="64">
        <register caption="PMECC Redundancy 0 Register (sec_num = 0)" count="14" name="HSMC_PMECC" offset="0x0" rw="R" size="4">
          <bitfield caption="BCH Redundancy" mask="0xFFFFFFFF" name="ECC"/>
        </register>
      </register-group>
      <register-group name="SMC_REM" size="64">
        <register caption="PMECC Remainder 0 Register (sec_num = 0)" name="HSMC_REM0_" offset="0x0" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 1 Register (sec_num = 0)" name="HSMC_REM1_" offset="0x4" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
        <register caption="PMECC Remainder 2 Register (sec_num = 0)" name="HSMC_REM2_" offset="0x8" rw="R" size="4">
          <bitfield caption="BCH Remainder 2 * N + 1" mask="0x00003FFF" name="REM2NP1"/>
          <bitfield caption="BCH Remainder 2 * N + 3" mask="0x3FFF0000" name="REM2NP3"/>
        </register>
