Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D27CD5M.atdf
        <register caption="UDPHS Test Register" name="UDPHS_TST" offset="0xE0" rw="RW" size="4">
          <bitfield caption="Speed Configuration" mask="0x00000003" name="SPEED_CFG" values="UDPHS_TST__SPEED_CFG"/>
          <bitfield caption="Test J Mode" mask="0x00000004" name="TST_J"/>
          <bitfield caption="Test K Mode" mask="0x00000008" name="TST_K"/>
          <bitfield caption="Test Packet Mode" mask="0x00000010" name="TST_PKT"/>
          <bitfield caption="OpMode2" mask="0x00000020" name="OPMODE2"/>
        </register>
        <register caption="UDPHS IP Address Size Register" name="UDPHS_ADDRSIZE" offset="0xEC" rw="R" size="4">
          <bitfield caption="Peripheral Bus Address Size" mask="0xFFFFFFFF" name="ADDRSIZE"/>
        </register>
        <register caption="UDPHS IP Name1 Register" count="2" name="UDPHS_IPNAME" offset="0xF0" rw="R" size="4">
          <bitfield caption="IP Name in ASCII Format" mask="0xFFFFFFFF" name="IPNAME"/>
        </register>
        <register caption="UDPHS Features Register" name="UDPHS_FEATURES" offset="0xF8" rw="R" size="4"/>
        <register-group count="16" name="UDPHS_EPT" name-in-module="UDPHS_EPT" offset="0x100" size="32"/>
        <register-group count="7" name="UDPHS_DMA" name-in-module="UDPHS_DMA" offset="0x300" size="16"/>
      </register-group>
      <value-group caption="Endpoint Size (cleared upon USB reset)" name="UDPHS_EPTCFG0__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="Endpoint Type (cleared upon USB reset)" name="UDPHS_EPTCFG0__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="Number of Banks (cleared upon USB reset)" name="UDPHS_EPTCFG0__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="Toggle Sequencing (cleared upon USB reset)" name="UDPHS_EPTSTA0__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="Busy Bank Number (cleared upon USB reset)" name="UDPHS_EPTSTA0__BUSY_BANK_STA">
        <value caption="All banks are free" name="_0BUSYBANK" value="0x0"/>
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x1"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x2"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x3"/>
      </value-group>
      <value-group caption="Toggle Sequencing (cleared upon USB reset)" name="UDPHS_EPTSTA0_ISOENDPT__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Data2 (only for High Bandwidth Isochronous Endpoint)" name="DATA2" value="0x2"/>
        <value caption="MData (only for High Bandwidth Isochronous Endpoint)" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="Current Bank (cleared upon USB reset)" name="UDPHS_EPTSTA0_ISOENDPT__CURBK">
        <value caption="Bank 0 (or single bank)" name="BANK0" value="0x0"/>
        <value caption="Bank 1" name="BANK1" value="0x1"/>
        <value caption="Bank 2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="Busy Bank Number (cleared upon USB reset)" name="UDPHS_EPTSTA0_ISOENDPT__BUSY_BANK_STA">
        <value caption="All banks are free" name="_0BUSYBANK" value="0x0"/>
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x1"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x2"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x3"/>
      </value-group>
      <value-group caption="Speed Configuration" name="UDPHS_TST__SPEED_CFG">
        <value caption="Normal mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode." name="NORMAL" value="0x0"/>
        <value caption="Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose." name="HIGH_SPEED" value="0x2"/>
        <value caption="Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake." name="FULL_SPEED" value="0x3"/>
      </value-group>
    </module>
    <module caption="USB Host High Speed Port" id="6354" name="UHPHS" version="R">
      <register-group name="UHPHS">
        <register caption="UHPHS Host Controller Capability Register" name="UHPHS_HCCAPBASE" offset="0x00" rw="R" size="4">
          <bitfield caption="Capability Registers Length" mask="0x000000FF" name="CAPLENGTH"/>
          <bitfield caption="Host Controller Interface Version Number" mask="0xFFFF0000" name="HCIVERSION"/>
        </register>
        <register caption="UHPHS Host Controller Structural Parameters Register" name="UHPHS_HCSPARAMS" offset="0x04" rw="R" size="4">
          <bitfield caption="Number of Ports" mask="0x0000000F" name="N_PORTS"/>
          <bitfield caption="Port Power Control" mask="0x00000010" name="PPC"/>
          <bitfield caption="Number of Ports per Companion Controller" mask="0x00000F00" name="N_PCC"/>
          <bitfield caption="Number of Companion Controllers" mask="0x0000F000" name="N_CC"/>
          <bitfield caption="Port Indicators" mask="0x00010000" name="P_INDICATOR"/>
          <bitfield caption="Debug Port Number" mask="0x00F00000" name="N_DP"/>
        </register>
